{
  "architectures": [
    "XLMRobertaForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 514,
  "model_type": "xlmroberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "type_vocab_size": 2,
  "vocab_size": 250002,
  "encoder_width": 768,
  "add_cross_attention": false,
  "use_cache": false,
  "gradient_checkpointing": true,
  "text_encoder_layers": 6,
  "fusion_layers": 6,
  "text_decode_layers": 12,
  "stride_layer": 6
}

